## Задание 1

Импортируйте библиотеку Pandas и дайте ей псевдоним pd. Создайте датафрейм authors со столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].
Затем создайте датафрейм book cо столбцами author_id, book_title и price, в которых соответственно содержатся данные: 
[1, 1, 1, 2, 2, 3, 3], 
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
[450, 300, 350, 500, 450, 370, 290].

### Решение

In [1]:
import pandas as pd

In [2]:
authors = pd.DataFrame({
    'author_id': [1, 2, 3],
    'author_name': ['Тургенев', 'Чехов', 'Островский'],
})

authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [3]:
books = pd.DataFrame({
    'author_id': [1, 1, 1, 2, 2, 3, 3],
    'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Тонстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
    'price': [450, 300, 350, 500, 450, 370, 290],
})

books

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Тонстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

## Задание 2

Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

### Решение:

In [4]:
authors_price = pd.merge(authors, books, on='author_id', how='inner')

In [5]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Тонстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

## Задание 3

Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

### Решение 1:

In [6]:
top5 = authors_price.sort_values(by="price", ascending=False).head()

In [7]:
top5

   author_id author_name         book_title  price
3          2       Чехов   Тонстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

### Решение 2:

In [64]:
top5 = authors_price.nlargest(5,"price")

In [65]:
top5

   author_id author_name         book_title  price
3          2       Чехов   Тонстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

## Задание 4

Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat должны быть четыре столбца:
author_name, min_price, max_price и mean_price,
в которых должны содержаться соответственно имя автора,минимальная, максимальная и средняя цена на книги этого автора.

### Решение

#### Вариант 1

In [66]:
authors_stat = authors_price.groupby("author_name")

In [67]:
min_price = authors_stat["price"].min()

In [68]:
max_price = authors_stat["price"].max()

In [69]:
mean_price = authors_stat["price"].mean()

In [70]:
authors_stat = pd.DataFrame(dict(min_price = min_price, max_price = max_price, mean_price=mean_price))

In [71]:
authors_stat

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000

#### Вариант 2

In [72]:
authors_stat_price['max_price'] = authors_price.groupby('author_name').agg({'price':'max'})
authors_stat_price['min_price'] = authors_price.groupby('author_name').agg({'price':'min'})
authors_stat_price['mean_price'] = authors_price.groupby('author_name').agg({'price':'mean'}).astype(int)

In [73]:
authors_stat_price

             max_price  min_price  mean_price
author_name
Островский         370        290         330
Тургенев           450        300         366
Чехов              500        450         475

## Задание 5**

Создайте новый столбец в датафрейме authors_price под названием cover, в нем будут располагаться данные о том, какая обложка у данной книги - твердая или мягкая. В этот столбец поместите данные из следующего списка:
['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая'].
Просмотрите документацию по функции pd.pivot_table с помощью вопросительного знака.Для каждого автора посчитайте суммарную стоимость книг в твердой и мягкой обложке. Используйте для этого функцию pd.pivot_table. При этом столбцы должны называться "твердая" и "мягкая", а индексами должны быть фамилии авторов. Пропущенные значения стоимостей заполните нулями, при необходимости загрузите библиотеку Numpy.
Назовите полученный датасет book_info и сохраните его в формат pickle под названием "book_info.pkl". Затем загрузите из этого файла датафрейм и назовите его book_info2. Удостоверьтесь, что датафреймы book_info и book_info2 идентичны.

### Решение:

In [215]:
import numpy as np
from pandas import DataFrame as df

In [169]:
cover_type =  ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']

In [170]:
authors_price['cover_type'] = cover_type

In [171]:
authors_price

   author_id author_name            book_title  price cover_type
0          1    Тургенев           Отцы и дети    450    твердая
1          1    Тургенев                 Рудин    300     мягкая
2          1    Тургенев     Дворянское гнездо    350     мягкая
3          2       Чехов      Тонстый и тонкий    500    твердая
4          2       Чехов       Дама с собачкой    450    твердая
5          3  Островский                 Гроза    370     мягкая
6          3  Островский  Таланты и поклонники    290     мягкая

In [172]:
?pd.pivot_table

In [187]:
book_info = pd.pivot_table(authors_price, values=['price'], index = ['author_name'], columns = ['cover_type'], aggfunc = np.sum).fillna(0)

In [188]:
book_info

             price
cover_type  мягкая твердая
author_name
Островский   660.0     0.0
Тургенев     650.0   450.0
Чехов          0.0   950.0

In [189]:
book_info.to_pickle("book_info.pkl")

In [190]:
book_info2 = pd.read_pickle("book_info.pkl")

In [191]:
book_info2

             price
cover_type  мягкая твердая
author_name
Островский   660.0     0.0
Тургенев     650.0   450.0
Чехов          0.0   950.0

In [218]:
book_info.equals(book_info2)

True